using System;

namespace PetrikovaPovtor
{
    class Program
    {
        static void Main(string[] args)
        {
            // Задание 4

            Console.WriteLine("Информация о студенте:");
            Console.WriteLine("Имя : Елизавета, Фамилия : Петрикова, Дата рождения : 2000 03 31");
            Console.WriteLine("Адрес: Тюмень, Пол: ж, Страна: Россия");
            Console.WriteLine("Course Information:");
            Console.WriteLine("Название курса : ИП-24-26б, Баллы:65, Количество занятий в неделю: 12, Преподаватель: Фруцкая Марина Алесандровна");
            Console.ReadKey();
        }
    }
}
